tap "deviceinsight/packages"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "bash"
brew "direnv"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-extras"
brew "go@1.22", link: true
brew "jq"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "mysql-client@8.4", link: true
brew "neovim"
brew "node"
brew "nushell"
brew "sqlite"
brew "python@3.12"
brew "oci-cli"
brew "pyenv"
brew "pyright"
brew "ripgrep"
brew "ruff"
brew "starship"
brew "tmux"
brew "tpm"
brew "watch"
brew "wget"
brew "yazi"
brew "zoxide"
brew "deviceinsight/packages/kafkactl"
cask "font-roboto-mono-nerd-font"
vscode "byted-ide.authenticator"
vscode "byted-ide.cloud-workspace"
vscode "byted-ide.gallery"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
