tap "deviceinsight/packages"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "staircase/tap", "https://code.byted.org/staircase/tap"
brew "direnv"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-extras"
brew "go@1.22"
brew "go@1.23"
brew "jq"
brew "lazygit"
brew "mysql-client@8.4", link: true
brew "neovim"
brew "node"
brew "nushell"
brew "oci-cli"
brew "opentofu"
brew "pnpm"
brew "pyenv"
brew "python@3.12"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "starship"
brew "terraform"
brew "tmux"
brew "tpm"
brew "watch"
brew "wget"
brew "yazi"
brew "zoxide"
brew "deviceinsight/packages/kafkactl"
brew "staircase/tap/staircase"
cask "font-roboto-mono-nerd-font"
cask "ghostty"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
go "code.byted.org/middleware/hertztool/v3"
go "github.com/google/pprof"
go "github.com/swaggo/swag/cmd/swag"
